rathead-industrial-products/lib-mitchell/setup/Ports/M4/arm_kinetis_start.c
/*******************************************************************************

    Entry point for ARM Kinetis programs. This module is completely
    stand-alone and does not require any libraries except for writing
    fault information to the Flash.

    Supported Processors:
    MCU_MKL25Z4
    MCU_MK22F25612
    MCU_MK22F51212


    Always compile this file with optimization -O1. There is a bug in the
    compiler with rtl epilogue generated for naked functions for optimization
    greater than -O1.

    https://gcc.gnu.org/bugzilla/show_bug.cgi?id=56732

*******************************************************************************/

#pragma GCC optimize ("O1")


/* Configuration parameters defined as START_ENABLED or START_DISABLED */
#define START_ENABLED       1
#define START_DISABLED      0

#define START_USB_GASKET    START_DISABLED
#define START_WATCHDOG      START_DISABLED
#define START_SET_VTOR      START_DISABLED



#include <string.h>
#include "MK22F25612.h"
#include "fault.h"


typedef struct {
  char *        source;
  char *        target;
  unsigned long size;
} rom_info_t;

#define UNUSED_STACK_FILL  (0x55)

extern int main(void);

extern char __START_BSS[];
extern char __END_BSS[];
extern char __STACK_START[];
extern char __SP_INIT[];
extern char __APPLICATION_BASE[];
extern char __CORE_DUMP_START[];


#ifdef MCU_MKL25Z4
#define SCB   SystemControl_BASE_PTR
#endif


#if (START_USB_GASKET == START_ENABLED)

#include "gasket.h"

/*******************************************************************************
 *
 * Vector here for all exceptions that are handled in the bootloader,
 * i.e. USB. Program flow is redirected to the address in the bootloader
 * exception table.
 *
 ******************************************************************************/
void Gasket_Handler(void) __attribute__((naked));
void Gasket_Handler(void) {
    __asm volatile (
            "mrs r0, ipsr\n"        // interrupt program status register
            "lsl r0, #2\n"          // current exception number x sizeof(word)
            "ldr r0, [r0]\n"        // fetch bootloader exception vector
            "bx r0\n"               // jump to bootloader exception
    );

}




/******************************************************************************
 *
 * flash_err_t flashEraseProgramBlock(void * p_sector, void * p_block, uint32_t block_size);
 *
 * Starting at p_sector, erase enough sectors to fully contain block_size, then
 * program the area with the data starting at p_block.
 *
 * Copied from flash.c which is not included in this project - the flash
 * routines in the bootloader gasket are used instead.
 *
 *****************************************************************************/
flash_err_t flashEraseProgramBlock(void * p_sector, void * p_block, uint32_t block_size) {
    int sectors = (block_size / FLASH_SECTOR_SIZE) + 1;
    uint32_t * p_prog_dst = (uint32_t *) p_sector;
    uint32_t * p_prog_src = (uint32_t *) p_block;
    flash_err_t err =  FLASH_NO_ERR;

    while (sectors-- && (err == FLASH_NO_ERR)) {
        err = ee_flashEraseSector(p_sector);
        p_sector = (char *) p_sector + FLASH_SECTOR_SIZE;
    }

    block_size = (block_size + 3) & 0xfffffffc;   // ensure block_size is longword multiple
    while (block_size && (err == FLASH_NO_ERR)) {
        err = ee_flashProgramLongword((void *) p_prog_dst, *p_prog_src);
        ++p_prog_dst;
        ++p_prog_src;
        block_size -= 4;
    }

    return (err);
}

#endif    /* (START_USB_GASKET == START_ENABLED) */


void saveFaultState (uint32_t * stacked_args) {
    struct fault_t  fault;

    fault.stacked_registers.r0  = stacked_args[0];
    fault.stacked_registers.r1  = stacked_args[1];
    fault.stacked_registers.r2  = stacked_args[2];
    fault.stacked_registers.r3  = stacked_args[3];
    fault.stacked_registers.r12 = stacked_args[4];
    fault.stacked_registers.lr  = stacked_args[5];
    fault.stacked_registers.pc  = stacked_args[6];

    /* pc points to NEXT instruction to be executed */

    fault.psr.reg   = stacked_args[7];
    fault.icsr.reg  = SCB->ICSR;
    fault.shcsr.reg = SCB->SHCSR;
    #if (__CORTEX_M != 0) /* regs don't exist on M0 */
    fault.cfsr.reg  = SCB->CFSR;
    fault.bfar.reg  = SCB->BFAR;
    fault.afsr.reg  = SCB->AFSR;
    #endif


#if (START_USB_GASKET == START_ENABLED)

    /* Save the fault information in the flash for post-mortem analysis */

    /*
     * Reduce the clocks to 60/30/12 MHz by changing the ext reference divider
     * from 12 (48 / 12 = 4 MHz external refclk) to 24 (2 MHz ext refclk).
     * Put the MCU into RUN mode.
     */
    MCG_C5 = (MCG_C5 &~MCG_C5_PRDIV0_MASK) | MCG_C5_PRDIV0(23);
    SMC_PMCTRL = SMC_PMCTRL_RUNM(0);

    (void) flashEraseProgramBlock((void *) __CORE_DUMP_START, (void *) &fault, sizeof(fault));

    /* Don't bother restoring MCU to HSRUN */

#endif    /* (START_USB_GASKET == START_ENABLED) */

    __asm volatile ("bkpt");
    while (1);
}


/*
 * Redirect here for all unhandled processor faults.
 *
 * From http://embeddedgurus.com/state-space/tag/arm-cortex-m/
 * Test the stack pointer. If it has overflowed the stack area, reset
 * it to the top of the stack before proceeding.
 *
 * Put the active stack pointer (MSP or PSP) into r0, and call saveFaultState()
 *
 * The fault state can then be examined in the debugger easily through
 * the predefined struct fault_t.
 *
 */
void Fault_Handler(void) __attribute__((naked));
void Fault_Handler(void) {
    __asm volatile (
            "mov r0, sp\n"
            "ldr r1, =__STACK_START\n"
            "cmp r0, r1\n"
            "bcs stack_ok\n"
            "ldr sp, =__SP_INIT\n"
        "stack_ok:\n"
            "mrs r0, psp\n"   // default for m0 until I recode in m0 assy
            #if (__CORTEX_M != 0)
            "tst lr, #4\n"
            "ite eq\n"
            "mrseq r0, msp\n"
            "mrsne r0, psp\n"
            #endif
            "b saveFaultState\n"
    );
}

/*
 * Redirect here for all uninitialized vectors and assertions.
 *
 */
void Default_Handler(void) __attribute__((naked));
void Default_Handler(void) {
    Fault_Handler();
}


