rathead-industrial-products/lib-mitchell/setup/Ports/M4/arm_kinetis_start.c
void Reset_Handler(void) __attribute__((naked));
void Reset_Handler(void)
{

    /* Disable interrupts */
    __asm volatile ("cpsid   i\n");


#if (START_WATCHDOG == START_DISABLED)
    #ifdef MCU_MKL25Z4
    SIM_COPC = 0x00;
    #elif defined MCU_MK22F25612
    WDOG->UNLOCK  = WDOG_UNLOCK_WDOGUNLOCK(0xC520); /* Key 1 */
    WDOG->UNLOCK  = WDOG_UNLOCK_WDOGUNLOCK(0xD928); /* Key 2 */
    WDOG->STCTRLH = WDOG->STCTRLH & ~WDOG_STCTRLH_WDOGEN_MASK;  /* set WDOGEN bit to 0 */
    #else
    #error ("Cannot disable watchdog - unknown MCU type.")
    #endif
#endif   /* (START_WATCHDOG == START_DISABLED) */


    /*
     * Set the vector base register
     */
#if (START_SET_VTOR == START_ENABLED)
    SCB->VTOR = (uint32_t) __APPLICATION_BASE;
#endif   /* (START_VTOR == START_ENABLED) */


    /*
     * Initialize the stack area for the stack sniffer. The stack area can
     * be filled all the way to the top because the stack pointer has not
     * been used yet. Symbols must be aligned to a 4 byte boundary.
     */
    __asm (
        "ldr r1, =__STACK_START\n"
        "ldr r2, =__SP_INIT\n"
        "ldr r0, =0x55555555\n"       // 0x55555555 = UNUSED_STACK_FILL
    ".LC3:\n"
        "cmp     r1, r2\n"
        "itt     lt\n"
        "strlt   r0, [r1], #4\n"
        "blt    .LC3\n"
    );

    /*
     *  Zero out BSS section. Symbols must be aligned to a 4 byte boundary.
     */
    __asm volatile (
        "ldr r1, =__START_BSS\n"
        "ldr r2, =__END_BSS\n"
        "movs    r0, 0\n"
    ".LC2:\n"
        "cmp     r1, r2\n"
        "itt    lt\n"
        "strlt   r0, [r1], #4\n"
        "blt    .LC2\n"
    );

    /*
     *  Copy data from read only memory to RAM. Symbols must be aligned to 4 byte boundary.
     */
    __asm volatile (
        "ldr    r1, =_etext\n"
        "ldr    r2, =_sdata\n"
        "ldr    r3, =_edata\n"
        "subs    r3, r2\n"
        "ble    .LC1\n"
    ".LC0:\n"
        "subs    r3, #4\n"
        "ldr    r0, [r1, r3]\n"
        "str    r0, [r2, r3]\n"
        "bgt    .LC0\n"
    ".LC1:\n"
    );

    //  call main
    #if (UNIT_TEST)
    __asm (
        "ldr r0, =unit_test_main\n"
        "mov pc,r0\n"
        );
    #else
    __asm (
        "ldr r0, =main\n"
        "mov pc,r0\n"
        );
    #endif /* UNIT TEST */
}


#if ((defined MCU_MK22F51212) || (defined MCU_MK22F25612))

/*
 * Weak definitions of handlers point to Default_Handler if not implemented
 */
//void Reset_Handler()              __attribute__ ((weak, alias("Fault_Handler")));
void NMI_Handler()                __attribute__ ((weak, alias("Default_Handler")));
void HardFault_Handler()          __attribute__ ((weak, alias("Fault_Handler")));
void MemManage_Handler()          __attribute__ ((weak, alias("Fault_Handler")));
void BusFault_Handler()           __attribute__ ((weak, alias("Fault_Handler")));
void UsageFault_Handler()         __attribute__ ((weak, alias("Fault_Handler")));
void SVC_Handler()                __attribute__ ((weak, alias("Default_Handler")));
void DebugMon_Handler()           __attribute__ ((weak, alias("Default_Handler")));
void PendSV_Handler()             __attribute__ ((weak, alias("Default_Handler")));
void SysTick_Handler()            __attribute__ ((weak, alias("Default_Handler")));

void DMA0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA2_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA3_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA4_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA5_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA6_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA7_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA8_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA9_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void DMA10_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void DMA11_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void DMA12_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void DMA13_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void DMA14_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void DMA15_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void DMA_Error_IRQHandler()       __attribute__ ((weak, alias("Default_Handler")));
void MCM_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void FTF_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void Read_Collision_IRQHandler()  __attribute__ ((weak, alias("Default_Handler")));
void LVD_LVW_IRQHandler()         __attribute__ ((weak, alias("Default_Handler")));
void LLW_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void Watchdog_IRQHandler()        __attribute__ ((weak, alias("Default_Handler")));
void RNG_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void I2C0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void I2C1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void SPI0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void SPI1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void I2S0_Tx_IRQHandler()         __attribute__ ((weak, alias("Default_Handler")));
void I2S0_Rx_IRQHandler()         __attribute__ ((weak, alias("Default_Handler")));
void LPUART0_IRQHandler()         __attribute__ ((weak, alias("Default_Handler")));
void UART0_RX_TX_IRQHandler()     __attribute__ ((weak, alias("Default_Handler")));
void UART0_ERR_IRQHandler()       __attribute__ ((weak, alias("Default_Handler")));
void UART1_RX_TX_IRQHandler()     __attribute__ ((weak, alias("Default_Handler")));
void UART1_ERR_IRQHandler()       __attribute__ ((weak, alias("Default_Handler")));
void UART2_RX_TX_IRQHandler()     __attribute__ ((weak, alias("Default_Handler")));
void UART2_ERR_IRQHandler()       __attribute__ ((weak, alias("Default_Handler")));
void ADC0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void CMP0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void CMP1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void FTM0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void FTM1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void FTM2_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void RTC_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void RTC_Seconds_IRQHandler()     __attribute__ ((weak, alias("Default_Handler")));
void PIT0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void PIT1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void PIT2_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void PIT3_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void PDB0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
#if (START_USB_GASKET == START_ENABLED)
void USB0_IRQHandler()            __attribute__ ((weak, alias("Gasket_Handler")));
#else
void USB0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
#endif
void DAC0_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));
void MCG_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void LPTimer_IRQHandler()         __attribute__ ((weak, alias("Default_Handler")));
void PORTA_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void PORTB_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void PORTC_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void PORTD_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void PORTE_IRQHandler()           __attribute__ ((weak, alias("Default_Handler")));
void SWI_IRQHandler()             __attribute__ ((weak, alias("Default_Handler")));
void ADC1_IRQHandler()            __attribute__ ((weak, alias("Default_Handler")));


