rathead-industrial-products/lib-mitchell/setup/Ports/M4/arm_kinetis_start.c
/*
 * Interrupt Vector Table
 *
 */
void (* const InterruptVector[])() __attribute__ ((section(".vectortable"))) = {
    (void(*)(void)) __SP_INIT,                       /* Top of Stack */
    Reset_Handler,                                   /* Reset Handler */
    NMI_Handler,                                     /* NMI Handler*/
    HardFault_Handler,                               /* Hard Fault Handler*/
    MemManage_Handler,                               /* MPU Fault Handler*/
    BusFault_Handler,                                /* Bus Fault Handler*/
    UsageFault_Handler,                              /* Usage Fault Handler*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    SVC_Handler,                                     /* SVCall Handler*/
    DebugMon_Handler,                                /* Debug Monitor Handler*/
    Default_Handler,                                 /* Reserved*/
    PendSV_Handler,                                  /* PendSV Handler*/
    SysTick_Handler,                                 /* SysTick Handler*/

    DMA0_IRQHandler,                                 /* DMA Channel 0 Transfer Complete*/
    DMA1_IRQHandler,                                 /* DMA Channel 1 Transfer Complete*/
    DMA2_IRQHandler,                                 /* DMA Channel 2 Transfer Complete*/
    DMA3_IRQHandler,                                 /* DMA Channel 3 Transfer Complete*/
    DMA4_IRQHandler,                                 /* DMA Channel 4 Transfer Complete*/
    DMA5_IRQHandler,                                 /* DMA Channel 5 Transfer Complete*/
    DMA6_IRQHandler,                                 /* DMA Channel 6 Transfer Complete*/
    DMA7_IRQHandler,                                 /* DMA Channel 7 Transfer Complete*/
    DMA8_IRQHandler,                                 /* DMA Channel 8 Transfer Complete*/
    DMA9_IRQHandler,                                 /* DMA Channel 9 Transfer Complete*/
    DMA10_IRQHandler,                                /* DMA Channel 10 Transfer Complete*/
    DMA11_IRQHandler,                                /* DMA Channel 11 Transfer Complete*/
    DMA12_IRQHandler,                                /* DMA Channel 12 Transfer Complete*/
    DMA13_IRQHandler,                                /* DMA Channel 13 Transfer Complete*/
    DMA14_IRQHandler,                                /* DMA Channel 14 Transfer Complete*/
    DMA15_IRQHandler,                                /* DMA Channel 15 Transfer Complete*/
    DMA_Error_IRQHandler,                            /* DMA Error Interrupt*/
    MCM_IRQHandler,                                  /* Normal Interrupt*/
    FTF_IRQHandler,                                  /* FTFA Command complete interrupt*/
    Read_Collision_IRQHandler,                       /* Read Collision Interrupt*/
    LVD_LVW_IRQHandler,                              /* Low Voltage Detect, Low Voltage Warning*/
    LLW_IRQHandler,                                  /* Low Leakage Wakeup*/
    Watchdog_IRQHandler,                             /* WDOG Interrupt*/
    RNG_IRQHandler,                                  /* RNG Interrupt*/
    I2C0_IRQHandler,                                 /* I2C0 interrupt*/
    I2C1_IRQHandler,                                 /* I2C1 interrupt*/
    SPI0_IRQHandler,                                 /* SPI0 Interrupt*/
    SPI1_IRQHandler,                                 /* SPI1 Interrupt*/
    I2S0_Tx_IRQHandler,                              /* I2S0 transmit interrupt*/
    I2S0_Rx_IRQHandler,                              /* I2S0 receive interrupt*/
    LPUART0_IRQHandler,                              /* LPUART0 status/error interrupt*/
    UART0_RX_TX_IRQHandler,                          /* UART0 Receive/Transmit interrupt*/
    UART0_ERR_IRQHandler,                            /* UART0 Error interrupt*/
    UART1_RX_TX_IRQHandler,                          /* UART1 Receive/Transmit interrupt*/
    UART1_ERR_IRQHandler,                            /* UART1 Error interrupt*/
    UART2_RX_TX_IRQHandler,                          /* UART2 Receive/Transmit interrupt*/
    UART2_ERR_IRQHandler,                            /* UART2 Error interrupt*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    ADC0_IRQHandler,                                 /* ADC0 interrupt*/
    CMP0_IRQHandler,                                 /* CMP0 interrupt*/
    CMP1_IRQHandler,                                 /* CMP1 interrupt*/
    FTM0_IRQHandler,                                 /* FTM0 fault, overflow and channels interrupt*/
    FTM1_IRQHandler,                                 /* FTM1 fault, overflow and channels interrupt*/
    FTM2_IRQHandler,                                 /* FTM2 fault, overflow and channels interrupt*/
    Default_Handler,                                 /* Reserved*/
    RTC_IRQHandler,                                  /* RTC interrupt*/
    RTC_Seconds_IRQHandler,                          /* RTC seconds interrupt*/
    PIT0_IRQHandler,                                 /* PIT timer channel 0 interrupt*/
    PIT1_IRQHandler,                                 /* PIT timer channel 1 interrupt*/
    PIT2_IRQHandler,                                 /* PIT timer channel 2 interrupt*/
    PIT3_IRQHandler,                                 /* PIT timer channel 3 interrupt*/
    PDB0_IRQHandler,                                 /* PDB0 Interrupt*/
    USB0_IRQHandler,                                 /* USB0 interrupt*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    DAC0_IRQHandler,                                 /* DAC0 interrupt*/
    MCG_IRQHandler,                                  /* MCG Interrupt*/
    LPTimer_IRQHandler,                              /* LPTimer interrupt*/
    PORTA_IRQHandler,                                /* Port A interrupt*/
    PORTB_IRQHandler,                                /* Port B interrupt*/
    PORTC_IRQHandler,                                /* Port C interrupt*/
    PORTD_IRQHandler,                                /* Port D interrupt*/
    PORTE_IRQHandler,                                /* Port E interrupt*/
    SWI_IRQHandler,                                  /* Software interrupt*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    Default_Handler,                                 /* Reserved*/
    ADC1_IRQHandler                                  /* ADC1 interrupt*/
};

